results/ai-agent-continuous/logs/chaos-spike-logs/k6-chaos-spike-run2.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m40s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 1m10s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 03/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 03/50 VUs  0m01.0s/1m10.0s

running (0m02.0s), 05/50 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 05/50 VUs  0m02.0s/1m10.0s

running (0m03.0s), 08/50 VUs, 7 complete and 0 interrupted iterations
default   [   4% ] 08/50 VUs  0m03.0s/1m10.0s

running (0m04.0s), 10/50 VUs, 19 complete and 0 interrupted iterations
default   [   6% ] 10/50 VUs  0m04.0s/1m10.0s

running (0m05.0s), 13/50 VUs, 31 complete and 0 interrupted iterations
default   [   7% ] 13/50 VUs  0m05.0s/1m10.0s

running (0m06.0s), 15/50 VUs, 44 complete and 0 interrupted iterations
default   [   9% ] 15/50 VUs  0m06.0s/1m10.0s

running (0m07.0s), 18/50 VUs, 65 complete and 0 interrupted iterations
default   [  10% ] 18/50 VUs  0m07.0s/1m10.0s

running (0m08.0s), 20/50 VUs, 82 complete and 0 interrupted iterations
default   [  11% ] 20/50 VUs  0m08.0s/1m10.0s

running (0m09.0s), 23/50 VUs, 105 complete and 0 interrupted iterations
default   [  13% ] 23/50 VUs  0m09.0s/1m10.0s

running (0m10.0s), 25/50 VUs, 129 complete and 0 interrupted iterations
default   [  14% ] 25/50 VUs  0m10.0s/1m10.0s

running (0m11.0s), 27/50 VUs, 158 complete and 0 interrupted iterations
default   [  16% ] 27/50 VUs  0m11.0s/1m10.0s

running (0m12.0s), 30/50 VUs, 184 complete and 0 interrupted iterations
default   [  17% ] 30/50 VUs  0m12.0s/1m10.0s

running (0m13.0s), 32/50 VUs, 210 complete and 0 interrupted iterations
default   [  19% ] 32/50 VUs  0m13.0s/1m10.0s

running (0m14.0s), 35/50 VUs, 238 complete and 0 interrupted iterations
default   [  20% ] 35/50 VUs  0m14.0s/1m10.0s

running (0m15.0s), 37/50 VUs, 267 complete and 0 interrupted iterations
default   [  21% ] 37/50 VUs  0m15.0s/1m10.0s

running (0m16.0s), 40/50 VUs, 287 complete and 0 interrupted iterations
default   [  23% ] 40/50 VUs  0m16.0s/1m10.0s

running (0m17.0s), 42/50 VUs, 317 complete and 0 interrupted iterations
default   [  24% ] 42/50 VUs  0m17.0s/1m10.0s

running (0m18.0s), 45/50 VUs, 343 complete and 0 interrupted iterations
default   [  26% ] 45/50 VUs  0m18.0s/1m10.0s

running (0m19.0s), 47/50 VUs, 371 complete and 0 interrupted iterations
default   [  27% ] 47/50 VUs  0m19.0s/1m10.0s

running (0m20.0s), 49/50 VUs, 402 complete and 0 interrupted iterations
default   [  29% ] 49/50 VUs  0m20.0s/1m10.0s

running (0m21.0s), 50/50 VUs, 444 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  0m21.0s/1m10.0s

running (0m22.0s), 50/50 VUs, 470 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  0m22.0s/1m10.0s

running (0m23.0s), 50/50 VUs, 499 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  0m23.0s/1m10.0s

running (0m24.0s), 50/50 VUs, 523 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  0m24.0s/1m10.0s

running (0m25.0s), 50/50 VUs, 551 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  0m25.0s/1m10.0s

running (0m26.0s), 50/50 VUs, 568 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  0m26.0s/1m10.0s

running (0m27.0s), 50/50 VUs, 605 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  0m27.0s/1m10.0s

running (0m28.0s), 50/50 VUs, 637 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  0m28.0s/1m10.0s

running (0m29.0s), 50/50 VUs, 665 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  0m29.0s/1m10.0s

running (0m30.0s), 50/50 VUs, 701 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  0m30.0s/1m10.0s

running (0m31.0s), 50/50 VUs, 728 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  0m31.0s/1m10.0s

running (0m32.0s), 50/50 VUs, 760 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  0m32.0s/1m10.0s

running (0m33.0s), 50/50 VUs, 791 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  0m33.0s/1m10.0s

running (0m34.0s), 50/50 VUs, 826 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  0m34.0s/1m10.0s

running (0m35.0s), 50/50 VUs, 843 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  0m35.0s/1m10.0s

running (0m36.0s), 50/50 VUs, 881 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  0m36.0s/1m10.0s

running (0m37.0s), 50/50 VUs, 915 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  0m37.0s/1m10.0s

running (0m38.0s), 50/50 VUs, 942 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  0m38.0s/1m10.0s

running (0m39.0s), 50/50 VUs, 978 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  0m39.0s/1m10.0s

running (0m40.0s), 50/50 VUs, 1008 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  0m40.0s/1m10.0s

running (0m41.0s), 50/50 VUs, 1041 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  0m41.0s/1m10.0s

running (0m42.0s), 50/50 VUs, 1074 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  0m42.0s/1m10.0s

running (0m43.0s), 50/50 VUs, 1101 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  0m43.0s/1m10.0s

running (0m44.0s), 50/50 VUs, 1135 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  0m44.0s/1m10.0s

running (0m45.0s), 50/50 VUs, 1170 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  0m45.0s/1m10.0s

running (0m46.0s), 50/50 VUs, 1200 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  0m46.0s/1m10.0s

running (0m47.0s), 50/50 VUs, 1226 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  0m47.0s/1m10.0s

running (0m48.0s), 50/50 VUs, 1264 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  0m48.0s/1m10.0s

running (0m49.0s), 50/50 VUs, 1287 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  0m49.0s/1m10.0s

running (0m50.0s), 50/50 VUs, 1318 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  0m50.0s/1m10.0s

running (0m51.0s), 50/50 VUs, 1347 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  0m51.0s/1m10.0s

running (0m52.0s), 50/50 VUs, 1389 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  0m52.0s/1m10.0s

running (0m53.0s), 50/50 VUs, 1428 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  0m53.0s/1m10.0s

running (0m54.0s), 50/50 VUs, 1449 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  0m54.0s/1m10.0s

running (0m55.0s), 50/50 VUs, 1486 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  0m55.0s/1m10.0s

running (0m56.0s), 50/50 VUs, 1521 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  0m56.0s/1m10.0s

running (0m57.0s), 50/50 VUs, 1540 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  0m57.0s/1m10.0s

running (0m58.0s), 50/50 VUs, 1576 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  0m58.0s/1m10.0s

running (0m59.0s), 50/50 VUs, 1616 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  0m59.0s/1m10.0s

running (1m00.0s), 50/50 VUs, 1644 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  1m00.0s/1m10.0s

running (1m01.0s), 48/50 VUs, 1678 complete and 0 interrupted iterations
default   [  87% ] 48/50 VUs  1m01.0s/1m10.0s

running (1m02.0s), 43/50 VUs, 1717 complete and 0 interrupted iterations
default   [  89% ] 43/50 VUs  1m02.0s/1m10.0s

running (1m03.0s), 40/50 VUs, 1743 complete and 0 interrupted iterations
default   [  90% ] 40/50 VUs  1m03.0s/1m10.0s

running (1m04.0s), 33/50 VUs, 1780 complete and 0 interrupted iterations
default   [  91% ] 33/50 VUs  1m04.0s/1m10.0s

running (1m05.0s), 28/50 VUs, 1810 complete and 0 interrupted iterations
default   [  93% ] 28/50 VUs  1m05.0s/1m10.0s

running (1m06.0s), 24/50 VUs, 1846 complete and 0 interrupted iterations
default   [  94% ] 24/50 VUs  1m06.0s/1m10.0s

running (1m07.0s), 17/50 VUs, 1872 complete and 0 interrupted iterations
default   [  96% ] 17/50 VUs  1m07.0s/1m10.0s

running (1m08.0s), 11/50 VUs, 1895 complete and 0 interrupted iterations
default   [  97% ] 11/50 VUs  1m08.0s/1m10.0s

running (1m09.0s), 07/50 VUs, 1912 complete and 0 interrupted iterations
default   [  99% ] 07/50 VUs  1m09.0s/1m10.0s

running (1m10.0s), 02/50 VUs, 1921 complete and 0 interrupted iterations
default   [ 100% ] 02/50 VUs  1m10.0s/1m10.0s


  █ TOTAL RESULTS 

    checks_total.......: 1923   27.268566/s
    checks_succeeded...: 48.67% 936 out of 1923
    checks_failed......: 51.32% 987 out of 1923

    ✗ Normal checkout processed
      ↳  0% — ✓ 0 / ✗ 987
    ✓ Malicious checkout rejected

    HTTP
    http_req_duration..............: avg=357.23ms min=145.36ms med=307.21ms max=1.45s p(90)=619.07ms p(95)=687.47ms
      { expected_response:true }...: avg=351.47ms min=145.36ms med=301.59ms max=1.02s p(90)=627.76ms p(95)=686.87ms
    http_req_failed................: 25.00% 1923 out of 7692
    http_reqs......................: 7692   109.074264/s

    EXECUTION
    iteration_duration.............: avg=1.44s    min=630.47ms med=1.48s    max=2.9s  p(90)=1.91s    p(95)=2.06s   
    iterations.....................: 1923   27.268566/s
    vus............................: 2      min=2            max=50
    vus_max........................: 50     min=50           max=50

    NETWORK
    data_received..................: 62 MB  873 kB/s
    data_sent......................: 470 MB 6.7 MB/s



running (1m10.5s), 00/50 VUs, 1923 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  1m10s